GREETINGS_WITH_PROMPT_RU = """
Здравствуйте!
Я просто агент. 
Вы уже задали системный промпт и теперь можете задавать мне любые вопросы. Я постараюсь ответить на них.
Доброе пожаловать!
"""

GREETINGS_WITHOUT_PROMPT_RU = """
Здравствуйте!
Я просто агент. Вы можете задать любой системный промпт и я буду вести диелог с Вами в соответствии с промптом.
"""

SET_PROPMT_REQUEST_RU = """
Пожалуйста, задайте системный промпт.
"""


PROMPT_CONFIRMATION_RU = """
Системный промпт задан! 
Начинаем диалог!
"""

DEFAULT_SYSTEM_PROMPT_RU = """
Ты полезный помощник. 
Веди диалог корректно. 
Отвечай на вопросы чётко и по делу. 
Не лей воду.
"""