GREETINGS_WITH_PROMPT_RU = """
Здравствуйте!
Я агент, который помогает создавать контент. 
Вы уже задали системный промпт и теперь можете задавать мне любые вопросы. Я постараюсь ответить на них.
Доброе пожаловать!
"""

GREETINGS_WITHOUT_PROMPT_RU = """
Здравствуйте!
Я агент, который помогает создавать контент. 
Вы можете задать любой системный промпт и я буду вести диалог с Вами в соответствии с промптом.
"""

СOMMIT_TOOL_PROMPT_RU = """
После того, как пользователь окончательно подтвердил финальные текст артефакта, вызови commit_artifact_final_text(final_text) и передай ТОЛЬКО текст артефакта.
"""

ARTIFACT_URL_PROMPT_RU = "Здесь вы можете скачать финальный отчёт."
ARTIFACT_STORE_ERROR_RU = "К сожалению, не могу сохранить артефакт в хранилище."


SET_PROPMT_REQUEST_RU = """
Пожалуйста, задайте системный промпт.
"""

PROMPT_CONFIRMATION_RU = """
Системный промпт задан! 
Начинаем диалог!
"""

DEFAULT_SYSTEM_PROMPT_RU = """
Ты полезный помощник. 
Веди диалог корректно. 
Отвечай на вопросы чётко и по делу. 
Не лей воду.
"""